Repository: ProMohamedMostafa/clean_tech_mobile
Catalog: lib/l10n/intl_*.arb
Languages: ur

# loginTitle1
source: Login
ur: لاگ ان

# loginTitle2
source: Login to access your Clean Tech account
ur: اپنے Clean Tech اکاؤنٹ تک رسائی کے لیے لاگ ان کریں

# labelEmail
source: Email or userName
ur: ای میل یا صارف نام

# labelPassword
source: Password
ur: پاس ورڈ

# validationEmail
source: Invalid email address
ur: غلط ای میل پتہ

# validationVerify
source: Invalid code
ur: غلط کوڈ

# validationUserName
source: User name is required
ur: صارف نام ضروری ہے

# validationFirstName
source: First name is required
ur: پہلا نام ضروری ہے

# validationLastName
source: Last name is required
ur: آخری نام ضروری ہے

# validationAddEmail
source: Email is required
ur: ای میل ضروری ہے

# validationAddEmail2
source: Invalid email format
ur: ای میل کا فارمٹ غلط ہے

# validationAddPassword
source: Password is required
ur: پاس ورڈ ضروری ہے

# validationAddPasswordConfirmation
source: Password confirmation is required
ur: پاس ورڈ کی تصدیق ضروری ہے

# validationIdNumber
source: ID number is required
ur: شناختی نمبر ضروری ہے

# validationNationality
source: Country is required
ur: ملک ضروری ہے

# validationCountry
source: Selected Country is required
ur: منتخب ملک ضروری ہے

# validationRole
source: Selected Role is required
ur: منتخب کردار ضروری ہے

# validationManager
source: Selected Manager is required
ur: منتخب مینیجر ضروری ہے

# validationGender
source: Gender is required
ur: جنس ضروری ہے

# validationProvider
source: Provider is required
ur: پرووائڈر ضروری ہے

# validationPhoneNumber
source: Phone number is required
ur: فون نمبر ضروری ہے

# validationBirthdate
source: Choose Birthdate is required
ur: پیدائش کی تاریخ منتخب کریں

# forgotPassButton
source: Forgot Password?
ur: پاس ورڈ بھول گئے؟

# validationRepeatPassword
source: Password not matched
ur: پاس ورڈ میچ نہیں کر رہا

# loginButton
source: Login
ur: لاگ ان

# termsConditions
source: Terms & Conditions and Conditions
ur: شرائط و ضوابط

# forgotPassScreenTitle1
source: Forgot your password?
ur: پاس ورڈ بھول گئے؟

# forgotPassScreenTitle2
source: Don’t worry, happens to all of us. Enter your email below to recover your password
ur: پریشان نہ ہوں، یہ ہم سب کے ساتھ ہوتا ہے۔ نیچے اپنا ای میل درج کریں

# forgotPassScreenTextField
source: Email
ur: ای میل

# submitButton
source: Submit
ur: جمع کریں

# verifyAccountScreenTitle1
source: Verify code
ur: کوڈ کی تصدیق کریں

# verifyAccountScreenTitle2
source: An authentication code has been sent to your email.
ur: تصدیقی کوڈ آپ کے ای میل پر بھیجا گیا ہے۔

# verifyAccountScreenTitle3
source: Didn’t receive a code?
ur: کوڈ موصول نہیں ہوا؟

# verifyAccountScreenTextField
source: Enter Code
ur: کوڈ درج کریں

# resendButton
source: Resend
ur: دوبارہ بھیجیں

# verifyButton
source: Verify
ur: تصدیق کریں

# setPassTitle1
source: Set a new password
ur: نیا پاس ورڈ مرتب کریں

# setPassTitle2
source: Your new password must be unique from those previously used.
ur: آپ کا نیا پاس ورڈ پچھلے سے مختلف ہونا چاہیے۔

# setPassTextField1
source: Create New Password
ur: نیا پاس ورڈ بنائیں

# setPassTextField2
source: Re-enter Password
ur: پاس ورڈ دوبارہ درج کریں

# setButton
source: Reset Password
ur: پاس ورڈ ری سیٹ کریں

# createPass1
source: At least 1 lowercase letter
ur: کم از کم ایک چھوٹا حرف

# createPass2
source: At least 1 uppercase letter
ur: کم از کم ایک بڑا حرف

# createPass3
source: At least 1 special character
ur: کم از کم ایک خاص علامت

# createPass4
source: At least 1 number
ur: کم از کم ایک نمبر

# createPass5
source: At least 8 characters long
ur: کم از کم 8 حروف

# doneTitl1
source: Password Changed!
ur: پاس ورڈ تبدیل ہوگیا!

# doneTitl2
source: Your password has been changed successfully.
ur: آپ کا پاس ورڈ کامیابی سے تبدیل ہوگیا۔

# donebutton
source: Back to login
ur: لاگ ان پر واپس جائیں

# botNavTitle1
source: Home
ur: ہوم

# botNavTitle2
source: Integrations
ur: انضمامات

# botNavTitle3
source: Calendar
ur: کالینڈر

# botNavTitle4
source: Settings
ur: سیٹنگز

# integ1
source: Users
ur: صارفین کا نظم و نسق

# integ2
source: Work Locations
ur: کام کے مقامات

# integ3
source: Assign
ur: تفویض کا نظم

# integ4
source: Shifts
ur: شفٹس

# integ5
source: Tasks
ur: کام

# integ6
source: Attendance
ur: حاضری

# integ7
source: Stock
ur: اسٹاک

# integ8
source: Activities
ur: سرگرمیاں

# integ9
source: Sensors
ur: سینسرز

# integ10
source: Providers
ur: مہیا کنندگان

# integ11
source: Feedback
ur: رائے

source: Integrations
ur: انضمامات

# settingTitle1
source: Profile
ur: پروفائل

# settingTitle2
source: Change password
ur: پاس ورڈ تبدیل کریں

# settingTitle3
source: Sharing App
ur: ایپ شیئر کریں

# settingTitle4
source: Technical Support
ur: ٹیکنیکل سپورٹ

# settingTitle5
source: Our Website
ur: ہماری ویب سائٹ

# settingTitle6
source: Languages
ur: زبانیں

# settingTitle7
source: Notification
ur: اطلاعات

# settingTitle8
source: Night Mode
ur: نائٹ موڈ

# settingTitle9
source: Log out
ur: لاگ آؤٹ

# addUserTitle
source: Add User
ur: نیا صارف شامل کریں

# addUserText1
source: First Name
ur: پہلا نام

# addUserText2
source: Last Name
ur: آخری نام

# addUserText3
source: Email
ur: ای میل

# addUserText4
source: Birthdate
ur: پیدائش کی تاریخ

# addUserText5
source: User Name
ur: صارف نام

# addUserText6
source: Password
ur: پاس ورڈ

# addUserText7
source: ID Number
ur: شناختی نمبر

# addUserText8
source: Nationality
ur: قومیت

# addUserText9
source: Gender
ur: جنس

# addUserText10
source: Phone Number
ur: فون نمبر

# addUserText11
source: Password Confirmation
ur: پاس ورڈ کی تصدیق

# addUserText12
source: Country
ur: ملک

# addUserText13
source: Role
ur: کردار

# addUserText14
source: Manager
ur: مینیجر

# addUserText15
source: Provider
ur: پرووائڈر

# addUserButton
source: Add User
ur: صارف شامل کریں

# addAnotherButton
source: Add Another
ur: ایک اور شامل کریں

# saveButtton
source: Save
ur: محفوظ کریں

# noButtton
source: NO
ur: نہیں

# yesButtton
source: Yes, i’m sure
ur: ہاں، مجھے یقین ہے

# deleteMessage
source: Are You Sure You Want To Remove This User ?
ur: کیا آپ واقعی اس صارف کو حذف کرنا چاہتے ہیں؟

# editUserTitle
source: Edit User
ur: صارف ترمیم کریں

# userDetailsTitle
source: User Details
ur: صارف کی تفصیلات

# deleteButton
source: Delete
ur: حذف کریں

# editButton
source: Edit
ur: ترمیم کریں

source: Welcome!
ur: خوش آمدید!

# experienceDescription
source: Experience a seamless way to manage cleaning services with just a few taps on your phone!
ur: اپنے فون پر چند نلکوں سے صفائی کی خدمات آسانی سے سنبھالیں!

# nextButton
source: Next
ur: اگلا

# loginMessage
source: Login to access your Clean Tech account
ur: اپنے Clean Tech اکاؤنٹ تک رسائی کے لیے لاگ ان کریں

# validationEmailAndUser
source: Invalid email address or userName
ur: ای میل یا صارف نام غلط ہے

# validationUsernameTooLong
source: Username or email is too long
ur: صارف نام یا ای میل بہت طویل ہے

# validationUsernameTooShort
source: Username or email is too short
ur: صارف نام یا ای میل بہت مختصر ہے

# validationPassword
source: Invalid password
ur: پاس ورڈ غلط ہے

# validationPasswordIncorrect
source: Password is incorrect
ur: پاس ورڈ غلط ہے

# validationEmailTooLong
source: Email is too long
ur: ای میل بہت طویل ہے

# validationEmailTooShort
source: Email is too short
ur: ای میل بہت مختصر ہے

# validationPinCodeEmpty
source: Please enter your pin code
ur: براہ کرم پن کوڈ درج کریں

source: Hey,
ur: ہیلو،

source: Show Activity
ur: سرگرمی دکھائیں

source: My Activity
ur: میری سرگرمی

source: My Team Activity
ur: میری ٹیم کی سرگرمی

# seeMoreButton
source: See More
ur: مزید دیکھیں

source: Low Stock
ur: کم اسٹاک

source: In Cost
ur: لاگت اندر

# cancelButton
source: Cancel
ur: منسوخ کریں

# saveButton
source: Save
ur: محفوظ کریں

source: Users
ur: صارفین

source: Admin
ur: ایڈمن

source: Manager
ur: مینیجر

source: Supervisor
ur: نگران

source: Cleaner
ur: صفائی کرنے والا

source: Attendance
ur: حاضری

source: Present
ur: حاضر

source: Absent
ur: فقدان

source: Leaves
ur: رخصتیں

source: Total Shifts
ur: کل شفٹیں

source: InActive
ur: غیر فعال

source: Active
ur: فعال

source: High
ur: اعلی

source: Medium
ur: درمیانہ

source: Low
ur: کم

source: Tasks
ur: کام

source: Pending
ur: زیر التوا

source: In Progress
ur: زیر عمل

# waitingForApproval
source: Waiting for Approvable
ur: منظر اداریہ

source: Complete
ur: مکمل

source: Not Resolved
ur: حل نہ ہوا

source: Overdue
ur: ڈیڈ لائن گزر چکی ہے

source: Stock Quantity
ur: سٹاک کی مقدار

# chartLine
source: Line
ur: لائن

# chartBar
source: Bar
ur: بار

# chartPie
source: Pie
ur: پائی

source: In side
ur: اندر

source: Out side
ur: باہر

source: Task completion rate
ur: کام مکمل کرنے کی شرح

source: Total Task
ur: کل کام

source: Notifications
ur: اطلاعات

source: Already marked as read
ur: پڑھا ہوا نشان لگا دیا گیا

source: All
ur: تمام

source: Unread
ur: غیر مطالعہ

source: Calendar
ur: کیلنڈر

source: No tasks available
ur: کوئی کام دستیاب نہیں

source: User Management
ur: صارف انتظام

source: Total Users
ur: کل صارفین

source: Deleted Users
ur: حذف شدہ صارفین

source: Find someone
ur: کسی کو تلاش کریں

# noData
source: There's no data
ur: کوئی ڈیٹا نہیں

# roleAdmin
source: Admin
ur: ایڈمن

# roleManager
source: Manager
ur: مینیجر

# roleSupervisor
source: Supervisor
ur: نگران

# roleUsers
source: Users
ur: صارفین

source: No Admins available
ur: کوئی ایڈمن دستیاب نہیں

source: No Managers available
ur: کوئی مینیجر دستیاب نہیں

source: No Supervisors available
ur: کوئی نگران دستیاب نہیں

source: No Users available
ur: کوئی صارف دستیاب نہیں

# validationFirstNameTooLong
source: First name must be less than 55 characters
ur: پہلا نام 55 حروف سے کم ہونا چاہیے

# validationFirstNameTooShort
source: First name must be at least 3 characters
ur: پہلا نام کم از کم 3 حروف ہونا چاہیے

# validationFirstNameOnlyLetters
source: First name must contain only letters
ur: پہلا نام صرف حروف پر مشتمل ہونا چاہیے

# validationLastNameTooLong
source: Last name must be less than 55 characters
ur: آخری نام 55 حروف سے کم ہونا چاہیے

# validationLastNameTooShort
source: Last name must be at least 3 characters
ur: آخری نام کم از کم 3 حروف ہونا چاہیے

# validationLastNameOnlyLetters
source: Last name must contain only letters
ur: آخری نام صرف حروف پر مشتمل ہونا چاہیے

# validationUserNameTooLong
source: Username must be less than 55 characters
ur: صارف نام 55 حروف سے کم ہونا چاہیے

# validationUserNameTooShort
source: Username must be at least 3 characters
ur: صارف نام کم از کم 3 حروف ہونا چاہیے

# validationValidEmail
source: Please enter a valid email address
ur: براہ کرم درست ای میل پتہ درج کریں

# validationValidMobileNumber
source: Please enter a valid mobile number
ur: براہ کرم درست فون نمبر درج کریں

# hintSelectCountry
source: Select Country
ur: ملک منتخب کریں

# hintSelectGender
source: Gender
ur: جنس

# genderMale
source: Male
ur: مرد

# genderFemale
source: Female
ur: عورت

# hintSelectNationality
source: Select Nationality
ur: قومیت منتخب کریں

# hintSelectRole
source: Select Role
ur: کردار منتخب کریں

source: No roles available
ur: کوئی کردار دستیاب نہیں

# validationBirthDateRequired
source: Birth date is required
ur: تاریخ پیدائش ضروری ہے

# validationIdNumberTooLong
source: ID number must be less than 20 characters
ur: شناختی نمبر 20 حروف سے کم ہونا چاہیے

# validationIdNumberTooShort
source: ID number must be at least 5 characters
ur: شناختی نمبر کم از کم 5 حروف ہونا چاہیے

# hintSelectProvider
source: Select Provider
ur: پرووائڈر منتخب کریں

# labelOptional
source: (Optional)
ur: (اختیاری)

# confirmSaveEdit
source: Are you sure you want to save the edit of this user?
ur: کیا آپ واقعی اس صارف کی ترمیم محفوظ کرنا چاہتے ہیں؟

# confirmRestoreUser
source: Are you sure to restore this user?
ur: کیا آپ واقعی اس صارف کو بحال کرنا چاہتے ہیں؟

# confirmForcedDelete
source: Force delete this user?
ur: کیا آپ اس صارف کو ہمیشہ کے لیے حذف کرنا چاہتے ہیں؟

source: No Manager
ur: کوئی مینیجر نہیں

source: No Provider
ur: کوئی پرووائڈر نہیں

source: User Details
ur: صارف کی تفصیلات

source: Filter
ur: فلٹر کریں

source: Area
ur: علاقہ

source: City
ur: شہر

source: Organization
ur: تنظیم

source: Building
ur: عمارت

source: Floor
ur: فلور

source: Section
ur: سیکشن

source: Point
ur: پوائنٹ

# sensorFirstLabel
source: All sensors
ur: تمام سینسرز

# sensorSecondLabel
source: Deleted sensors
ur: حذف شدہ سینسرز

# sensorHint
source: find sensor
ur: سینسر تلاش کریں

# sensorTextLastRead
source: Last read
ur: آخری ریڈنگ

# sensorTextAgo
source: ago
ur: پہلے

# TitleRestore
source: restore
ur: بحال کریں

# sensorBody
source: sensor
ur: سینسر

source: Type
ur: قسم

source: Battery
ur: بیٹری

source: Edit Location
ur: مقام میں ترمیم کریں

source: Duration :
ur: دورانیہ :

# shiftField
source: Shift :
ur: شفٹ :

source: Name
ur: نام

source: Discription
ur: تفصیل

# RemoveLocationButton
source: Remove Location
ur: مقام ہٹائیں

source: Sensor details
ur: سینسر کی تفصیلات

# ReadMoreButton
source: Read more
ur: مزید پڑھیں

# ReadLessButton
source: Read less
ur: کم پڑھیں

# TitleEdit
source: edit
ur: ترمیم

# TitleRemove
source: remove location
ur: مقام ہٹائیں

source: Min
ur: کم از کم

source: Max
ur: زیادہ سے زیادہ

# TitleAdd
source: add
ur: شامل کریں

# limitBody
source: limit
ur: حد

# addButton
source: Add
ur: شامل کریں

# TitleDelete
source: delete
ur: حذف کریں

# noTasks
source: There's no tasks
ur: کوئی کام نہیں ہے

# reloadButton
source: Reload
ur: دوبارہ لوڈ کریں

source: All Tasks
ur: تمام کام

# pendingTask
source: Pending
ur: زیر التواء

# inProgressTask
source: In Progress
ur: جاری ہے

# notApproval
source: Waiting for Approval
ur: منظوری نہیں

source: Completed
ur: مکمل

source: Rejected
ur: مسترد

# notResolvedTask
source: Not Resolved
ur: حل نہیں ہوا

# overdueTask
source: Overdue
ur: تاخیر شدہ

# totalShiftss
source: Total Shifts
ur: کل شفٹس

source: Deleted Shifts
ur: حذف شدہ شفٹس

source: Find shift
ur: شفٹ تلاش کریں

# shiftBody
source: Shift
ur: شفٹ

source: Create Shift
ur: شفٹ بنائیں

source: Shift Name
ur: شفٹ کا نام

source: Enter Shift
ur: شفٹ درج کریں

# shiftNameRequiredValidation
source: Shift Name is Required
ur: شفٹ کا نام ضروری ہے

# shiftNameTooLongValidation
source: Shift name too long
ur: شفٹ کا نام بہت لمبا ہے

# shiftNameTooShortValidation
source: Shift name too short
ur: شفٹ کا نام بہت چھوٹا ہے

source: Start Date
ur: آغاز کی تاریخ

# startDateRequiredValidation
source: Start date is required
ur: آغاز کی تاریخ ضروری ہے

source: End Date
ur: خاتمے کی تاریخ

# endDateRequiredValidation
source: End date is required
ur: خاتمے کی تاریخ ضروری ہے

source: Start Time
ur: آغاز کا وقت

# startTimeRequiredValidation
source: Start time is required
ur: آغاز کا وقت ضروری ہے

source: End Time
ur: خاتمے کا وقت

# endTimeRequiredValidation
source: End Time is required
ur: خاتمے کا وقت ضروری ہے

source: Select organization
ur: تنظیمیں منتخب کریں

source: Select building
ur: عمارت منتخب کریں

source: Select floor
ur: منزل منتخب کریں

source: Select section
ur: سیکشن منتخب کریں

# createButton
source: Create
ur: بنائیں

source: Edit Shift
ur: شفٹ میں ترمیم کریں

source: Shift Details
ur: تفاصيل الوردية

source: Providers
ur: فراہم کنندگان

source: Add Provider
ur: فراہم کنندہ شامل کریں

source: Provider Name
ur: فراہم کنندہ کا نام

source: Total providers
ur: کل فراہم کنندگان

source: Deleted providers
ur: حذف شدہ فراہم کنندگان

source: Edit Provider
ur: فراہم کنندہ میں ترمیم کریں

# providerBody
source: Provider
ur: فراہم کنندہ

source: Find provider
ur: فراہم کنندہ تلاش کریں

source: Activities
ur: سرگرمیاں

source: My Activities
ur: میری سرگرمیاں

source: My Team Activities
ur: میری ٹیم کی سرگرمیاں

source: History
ur: تاریخ

source: Shift :
ur: شفٹ :

source: Reject
ur: مسترد

source: Approved
ur: منظور شدہ

source: Leave details
ur: چھٹی کی تفصیلات

source: Reason
ur: وجہ

source: File
ur: فائل

# noFile
source: There's no file
ur: کوئی فائل نہیں ہے

# Titleapprove
source: approve
ur: منظور کریں

# approveButton
source: Approve
ur: منظور کریں

# leaveBody
source: Leave
ur: چھٹی

# rejectButton
source: Reject
ur: مسترد کریں

# rejectionReason
source: Reason for rejection
ur: مسترد کرنے کی وجہ

# reasonHint
source: reason..
ur: وجہ..

# approveBody
source: approve
ur: منظور کریں

source: Create Leave
ur: چھٹی بنائیں

source: Employee Name
ur: ملازم کا نام

source: Select Employee
ur: ملازم منتخب کریں

# noEmployeeValidation
source: No employee available
ur: کوئی ملازم دستیاب نہیں

# employeeNameRequiredValidation
source: Employee name is required
ur: ملازم کا نام ضروری ہے

source: Sick
ur: بیمار

source: Annual
ur: سالانہ

source: Ordinary
ur: معمولی

source: Select type
ur: قسم منتخب کریں

# typeRequired
source: Type is required
ur: قسم ضروری ہے

# writeReason
source: Write the reason for the leave
ur: چھٹی کی وجہ لکھیں

# reasonRequiredValidation
source: Reason is required
ur: وجہ ضروری ہے

source: Upload file
ur: فائل اپ لوڈ کریں

source: Edit Leave
ur: چھٹی میں ترمیم کریں

source: Category
ur: زمرہ

source: Material
ur: مواد

source: Transactions
ur: لین دین

source: Stock
ur: اسٹاک

source: Transaction Management
ur: لین دین کا انتظام

source: Inside
ur: اندر

source: Outside
ur: باہر

source: Find transaction
ur: لین دین تلاش کریں

# categoryLabel
source: Category:
ur: زمرہ:

# quantityLabel
source: Quantity:
ur: مقدار:

# totalPriceLabel
source: Total Price:
ur: کل قیمت:

source: Find activity
ur: سرگرمی تلاش کریں

source: Find history
ur: تاریخ تلاش کریں

source: Find leaves
ur: چھٹیاں تلاش کریں

source: Material details
ur: مواد کی تفصیلات

source: Quantity
ur: مقدار

source: Minimum
ur: کم از کم

source: Description
ur: تفصیل

source: Transaction details
ur: لین دین کی تفصیلات

source: User
ur: صارف

source: Total Quantity
ur: کل مقدار

source: Total Price
ur: کل قیمت

source: Date
ur: تاریخ

source: Time
ur: وقت

source: Files uploaded
ur: اپ لوڈ کردہ فائلیں

source: Add material
ur: مواد شامل کریں

# writeQuantity
source: Write quantity number
ur: مقدار کا نمبر لکھیں

# quantityRequired
source: Quantity is required
ur: مقدار ضروری ہے

# quantityTooLong
source: Quantity is too long
ur: مقدار بہت لمبی ہے

source: Price
ur: قیمت

source: (unit)
ur: (یونٹ)

# writePrice
source: Write price number
ur: قیمت کا نمبر لکھیں

# priceRequired
source: Price is required
ur: قیمت ضروری ہے

# priceTooLong
source: Price is too long
ur: قیمت بہت لمبی ہے

source: Find material
ur: مواد تلاش کریں

# materialBody
source: material
ur: مواد

# minimumLabel
source: Minimum:
ur: کم از کم:

source: Material Management
ur: مواد کا انتظام

source: Total Materials
ur: کل مواد

source: Deleted Materials
ur: حذف شدہ مواد

# reduceButton
source: Reduce
ur: کم کریں

source: Reduce material
ur: مواد کم کریں

source: Edit Material
ur: مواد میں ترمیم کریں

source: Material Name
ur: مواد کا نام

# materialNameRequired
source: Material Name is Required
ur: مواد کا نام ضروری ہے

source: Material name too long
ur: مواد کا نام بہت لمبا ہے

source: Material name too short
ur: مواد کا نام بہت چھوٹا ہے

# minimumRequired
source: Minimum is Required
ur: کم از کم مقدار ضروری ہے

# minimumTooLong
source: Minimum is too long
ur: کم از کم مقدار بہت زیادہ ہے

# materialDescriptionRequired
source: Material description is Required
ur: مواد کی تفصیل ضروری ہے

source: Material description too short
ur: مواد کی تفصیل بہت مختصر ہے

# descriptionHint
source: description...
ur: تفصیل...

source: Edit Category
ur: زمرہ میں ترمیم کریں

source: Category Name
ur: زمرے کا نام

# categoryNameRequired
source: Category Name is Required
ur: زمرے کا نام ضروری ہے

source: Category name too long
ur: زمرے کا نام بہت لمبا ہے

source: Category name too short
ur: زمرے کا نام بہت چھوٹا ہے

# unitTitle
source: Unit
ur: یونٹ

source: Ml
ur: ملی لیٹر

source: L
ur: لیٹر

source: Kg
ur: کلوگرام

source: G
ur: گرام

source: M
ur: میٹر

source: Cm
ur: سینٹی میٹر

source: Pieces
ur: ٹکڑے

# categoryBody
source: category
ur: زمرہ

source: Parent Category
ur: مرکزی زمرہ

source: Find category
ur: زمرہ تلاش کریں

# unitLabel
source: Unit:
ur: یونٹ:

source: Category Management
ur: زمرہ کا انتظام

source: Total Categories
ur: کل زمرے

source: Deleted Categories
ur: حذف شدہ زمرے

source: Create Material
ur: مواد بنائیں

source: Enter Material
ur: مواد درج کریں

source: Select category
ur: زمرہ منتخب کریں

# writeMinimum
source: Write minimum number
ur: کم از کم نمبر لکھیں

source: Create Category
ur: زمرہ بنائیں

source: Enter Category
ur: زمرہ درج کریں

# unitRequired
source: Unit is Required
ur: یونٹ ضروری ہے

source: Select unit
ur: یونٹ منتخب کریں

source: Categories
ur: اقسام

source: Materials
ur: مواد

source: Work Location
ur: کام کی جگہ

source: Add Area
ur: علاقہ شامل کریں

source: Select country
ur: ملک منتخب کریں

source: Area Name
ur: علاقے کا نام

# areaNameRequired
source: Area name is required
ur: علاقے کا نام ضروری ہے

source: Area name too long
ur: علاقے کا نام بہت لمبا ہے

source: Area name too short
ur: علاقے کا نام بہت چھوٹا ہے

source: Managers
ur: مینجرز

# noManagers
source: No managers available
ur: کوئی مینجر دستیاب نہیں

source: Select managers
ur: مینجرز منتخب کریں

source: Supervisors
ur: سپر وائزرز

# noSupervisors
source: No supervisors available
ur: کوئی سپر وائزر دستیاب نہیں

source: Select supervisors
ur: سپر وائزرز منتخب کریں

source: Cleaners
ur: صفائی کرنے والے

# noCleaners
source: No cleaners available
ur: کوئی صفائی کرنے والا دستیاب نہیں

source: Select cleaners
ur: صفائی کرنے والے منتخب کریں

source: No country
ur: کوئی ملک نہیں

source: Add City
ur: شہر شامل کریں

source: City Name
ur: شہر کا نام

# cityNameRequired
source: City name is required
ur: شہر کا نام ضروری ہے

source: City name too long
ur: شہر کا نام بہت لمبا ہے

source: City name too short
ur: شہر کا نام بہت چھوٹا ہے

source: Select area
ur: علاقہ منتخب کریں

source: Select city
ur: شہر منتخب کریں

source: Organization Name
ur: ادارے کا نام

# organizationNameRequired
source: Organization name is required
ur: ادارے کا نام ضروری ہے

source: Organization name too long
ur: ادارے کا نام بہت لمبا ہے

source: Organization name too short
ur: ادارے کا نام بہت چھوٹا ہے

source: Add Organization
ur: ادارہ شامل کریں

source: Add Building
ur: عمارت شامل کریں

source: Select organizations
ur: ادارے منتخب کریں

source: Building Name
ur: عمارت کا نام

# buildingNameRequired
source: Building name is required
ur: عمارت کا نام ضروری ہے

source: Building name too long
ur: عمارت کا نام بہت لمبا ہے

source: Building name too short
ur: عمارت کا نام بہت چھوٹا ہے

source: Building Number
ur: عمارت کا نمبر

# buildingNumberRequired
source: Building number is required
ur: عمارت کا نمبر ضروری ہے

source: Building number too long
ur: عمارت کا نمبر بہت لمبا ہے

source: Building Description
ur: عمارت کی تفصیل

# descriptionRequired
source: Description is required
ur: تفصیل ضروری ہے

source: Description too short
ur: تفصیل بہت مختصر ہے

source: Add Floor
ur: منزلہ شامل کریں

source: Floor Name
ur: منزلہ کا نام

# floorNameRequired
source: Floor name is required
ur: منزلہ کا نام ضروری ہے

source: Floor name too long
ur: منزلہ کا نام بہت لمبا ہے

source: Floor name too short
ur: منزلہ کا نام بہت چھوٹا ہے

source: Floor Number
ur: منزلہ کا نمبر

# floorNumberRequired
source: Floor number is required
ur: منزلہ کا نمبر ضروری ہے

source: Floor number too long
ur: منزلہ کا نمبر بہت لمبا ہے

source: Floor Description
ur: منزلہ کی تفصیل

source: Add Section
ur: سیکشن شامل کریں

source: Section Name
ur: سیکشن کا نام

# sectionNameRequired
source: Section name is required
ur: سیکشن کا نام ضروری ہے

source: Section name too long
ur: سیکشن کا نام بہت لمبا ہے

source: Section name too short
ur: سیکشن کا نام بہت چھوٹا ہے

source: Section Number
ur: سیکشن نمبر

# sectionNumberRequired
source: Section number is required
ur: سیکشن نمبر ضروری ہے

source: Section number too long
ur: سیکشن نمبر بہت لمبا ہے

source: Section Description
ur: سیکشن کی تفصیل

source: Add Point
ur: پوائنٹ شامل کریں

source: Point Name
ur: پوائنٹ کا نام

# pointNameRequired
source: Point name is required
ur: پوائنٹ کا نام ضروری ہے

source: Point name too long
ur: پوائنٹ کا نام بہت لمبا ہے
