Repository: ProMohamedMostafa/clean_tech_mobile
Catalog: lib/l10n/intl_*.arb
Languages: ur

source: Point name too short
ur: پوائنٹ کا نام بہت چھوٹا ہے

source: Point Number
ur: پوائنٹ نمبر

# pointNumberRequired
source: Point number is required
ur: پوائنٹ نمبر ضروری ہے

source: Point number too long
ur: پوائنٹ نمبر بہت لمبا ہے

source: Point Description
ur: پوائنٹ کی تفصیل

source: Sensor
ur: سینسر

source: Select sensor
ur: سینسر منتخب کریں

source: Is Countable:
ur: کیا یہ قابلِ شمار ہے:

source: Yes
ur: ہاں

source: No
ur: نہیں

source: Capacity
ur: گنجائش

source: Write capacity
ur: گنجائش لکھیں

# capacityRequired
source: Capacity is required
ur: گنجائش ضروری ہے

source: Capacity too long
ur: گنجائش بہت زیادہ ہے

source: No shifts available
ur: کوئی شفٹ دستیاب نہیں ہے

source: Select shift
ur: شفٹ منتخب کریں

source: Edit Area
ur: علاقہ ترمیم کریں

# areaBody
source: area
ur: علاقہ

source: Edit Building
ur: عمارت ترمیم کریں

# buildingBody
source: building
ur: عمارت

source: Edit City
ur: شہر ترمیم کریں

# cityBody
source: city
ur: شہر

source: Edit Floor
ur: منزل ترمیم کریں

# floorBody
source: floor
ur: منزل

source: Edit Organization
ur: ادارہ ترمیم کریں

# organizationBody
source: organization
ur: ادارہ

source: Edit Point
ur: نقطہ ترمیم کریں

# pointBody
source: point
ur: نقطہ

source: Edit Section
ur: سیکشن ترمیم کریں

# sectionBody
source: section
ur: سیکشن

source: Area details
ur: علاقے کی تفصیلات

source: City details
ur: شہر کی تفصیلات

source: Organization details
ur: تنظیم کی تفصیلات

source: Building details
ur: عمارت کی تفصیلات

source: Floor details
ur: منزل کی تفصیلات

source: Section details
ur: سیکشن کی تفصیلات

source: Point details
ur: پوائنٹ کی تفصیلات

source: Shifts
ur: شفٹیں

source: Country
ur: ملک

source: Device
ur: آلہ

source: Areas
ur: علاقے

source: Cities
ur: شہر

source: Organizations
ur: تنظیمات

source: Buildings
ur: عمارتیں

source: Floors
ur: منزلیں

source: Sections
ur: سیکشنز

source: Points
ur: پوائنٹس

source: Total
ur: کل

source: Deleted
ur: حذف شدہ

source: Find name of work location
ur: کام کی جگہ کا نام تلاش کریں

source: Create Task
ur: کام بنائیں

source: Select Priority
ur: ترجیح منتخب کریں

# priority_required
source: Priority is Required
ur: ترجیح ضروری ہے

source: Parent task
ur: مرکزی کام

source: Select parent task
ur: مرکزی کام منتخب کریں

source: Task Title
ur: کام کا عنوان

source: Enter task title
ur: کام کا عنوان درج کریں

# task_title_required
source: Task title is Required
ur: کام کا عنوان ضروری ہے

source: Task title too long
ur: کام کا عنوان بہت لمبا ہے

source: Task title too short
ur: کام کا عنوان بہت مختصر ہے

source: Select point
ur: نقطہ منتخب کریں

source: Currently reading
ur: موجودہ ریڈنگ

source: Write Currently reading
ur: موجودہ ریڈنگ لکھیں

# currently_reading_required
source: Currently reading is Required
ur: موجودہ ریڈنگ ضروری ہے

source: Currently reading too long
ur: موجودہ ریڈنگ بہت لمبی ہے

source: Status
ur: حیثیت

# status_required
source: Status is Required
ur: حیثیت ضروری ہے

source: Employee
ur: ملازم

source: Take photo
ur: تصویر لیں

source: Edit Task
ur: کام میں ترمیم کریں

source: Files
ur: فائلیں

# taskbody
source: task
ur: کام

source: My tasks
ur: میرے کام

source: Received tasks
ur: موصول شدہ کام

source: My team tasks
ur: میری ٹیم کے کام

source: Find task
ur: کام تلاش کریں

# ip_required
source: IP is Required
ur: IP درکار ہے

# ip_invalid_format
source: Enter a valid IP (e.g. 192.168.1.1)
ur: درست IP درج کریں (مثلاً 192.168.1.1)

# enter_network_ip
source: Please enter your network IP
ur: براہ کرم اپنا نیٹ ورک IP درج کریں

source: Network IP
ur: نیٹ ورک IP

source: Check IP
ur: IP چیک کریں

source: Select Parent Category
ur: مرکزی زمرہ منتخب کریں

source: Transaction type
ur: ٹرانزیکشن کی قسم

source: Activity status
ur: سرگرمی کی حیثیت

source: Select status
ur: حیثیت منتخب کریں

source: Is Assign
ur: تفویض کیا گیا

source: Select
ur: منتخب کریں

source: Created By
ur: بنایا گیا

source: Select user
ur: صارف منتخب کریں

source: No user
ur: کوئی صارف نہیں

source: Assign to
ur: تفویض کریں

source: In Progress
ur: جاری ہے

source: Not Approval
ur: منظوری نہیں ملی

source: Not Resolved
ur: حل نہیں ہوا

source: Priority
ur: ترجیح

source: Select Role
ur: کردار منتخب کریں

source: Select shift
ur: شفٹ منتخب کریں

source: Select Users
ur: صارفین منتخب کریں

source: Module
ur: ماڈیول

source: Select module
ur: ماڈیول منتخب کریں

source: Action
ur: عمل

source: Select action
ur: عمل منتخب کریں

source: Provider
ur: فراہم کنندہ

source: Select Provider
ur: فراہم کنندہ منتخب کریں

source: Select Sensor
ur: سینسر منتخب کریں

source: Is Active
ur: کیا فعال ہے؟

source: Male
ur: مرد

source: Female
ur: خاتون

source: Gender
ur: صنف

source: Select Nationality
ur: قومیت منتخب کریں

source: Select Work location
ur: کام کی جگہ منتخب کریں

source: Chart Type
ur: چارٹ کی قسم

source: Line
ur: لکیر

source: Bar
ur: بار

source: Pie
ur: پائی

source: Change Password
ur: پاس ورڈ تبدیل کریں

# change_password_description
source: Please, setup a new password for your account
ur: براہ کرم اپنے اکاؤنٹ کے لیے نیا پاس ورڈ سیٹ کریں

source: Old Password
ur: پرانا پاس ورڈ

source: New Password
ur: نیا پاس ورڈ

source: Confirm Password
ur: پاس ورڈ کی تصدیق کریں

# changePasswordbutton
source: Change Password
ur: پاس ورڈ تبدیل کریں

# TitleChangePassword
source: Change Password
ur: پاس ورڈ تبدیل کریں

# profileBody
source: profile
ur: پروفائل

source: Task details
ur: تفصیل کام

source: Total Time
ur: کل وقت

# task_not_started
source: The task isn't start yet.
ur: کام ابھی شروع نہیں ہوا۔

# task_not_completed
source: The task isn't complete yet.
ur: کام ابھی مکمل نہیں ہوا۔

# start_time
source: Start:
ur: آغاز:

# end_time
source: End:
ur: اختتام:

source: Device name
ur: ڈیوائس کا نام

source: After Reading
ur: پڑھنے کے بعد

source: Task Team
ur: ٹاسک ٹیم

source: No employee added
ur: کوئی ملازم شامل نہیں کیا گیا

source: No file uploaded
ur: کوئی فائل اپ لوڈ نہیں ہوئی

source: files uploaded
ur: فائلیں اپ لوڈ ہو چکی ہیں

source: Comments
ur: تبصرے

# no_comments
source: There's no comments
ur: کوئی تبصرے نہیں ہیں

source: Add Comment
ur: تبصرہ شامل کریں

# write_comment
source: write your comment
ur: اپنا تبصرہ لکھیں

# comment_or_image_required
source: Comment or Image is required
ur: تبصرہ یا تصویر درکار ہے

# startButton
source: Start
ur: شروع کریں

# notresolvedButton
source: NotResolved
ur: حل نہیں ہوا

# completeButton
source: Complete
ur: مکمل کریں

# duration2
source: Duration
ur: دورانیہ

# doneButton2
source: Done
ur: مکمل

# trueSelect
source: True
ur: درست

# falseSelect
source: False
ur: غلط

# inSelect
source: In
ur: آمد

# outSelect
source: Out
ur: روانگی

# assignButton
source: Assign
ur: تفویض کریں

# noActivities
source: There's no activities
ur: کوئی سرگرمیاں نہیں ہیں

# loginDescription
source: Login to access your Clean Tech account
ur: کلین ٹیک اکاؤنٹ تک رسائی کے لیے لاگ ان کریں

source: Profile Details
ur: پروفائل کی تفصیلات

source: Edit Profile Details
ur: پروفائل کی تفصیلات میں ترمیم کریں

source: Sensors Task Completion Rates
ur: سینسرز ٹاسک مکمل کرنے کی شرحیں

source: Select section
ur: حصہ منتخب کریں

source: Total completed sensors tasks
ur: کل مکمل شدہ سینسرز کے ٹاسک

source: Total pending sensors tasks
ur: کل زیر التوا کام کے سینسرز

source: Total in progress sensors tasks
ur: کل جاری کام کے سینسرز

source: Total overdue sensors tasks
ur: کل لیٹ کام کے سینسرز

source: Sensors
ur: سینسرز

source: Battery
ur: بیٹری

source: Tasks
ur: ٹاسک

source: All Users
ur: تمام صارفین

source: All Providers
ur: تمام فراہم کنندگان

# unknown_error
source: An unknown error occurred. Please try again.
ur: ایک نامعلوم خرابی پیش آگئی۔ براہ کرم دوبارہ کوشش کریں۔

# username_already_exists
source: This username is already taken.
ur: یہ صارف نام پہلے ہی استعمال ہو رہا ہے۔

# email_already_exists
source: This email is already registered.
ur: یہ ای میل پہلے ہی رجسٹرڈ ہے۔

# password_reset_required
source: You need to reset your password.
ur: آپ کو اپنا پاس ورڈ ری سیٹ کرنے کی ضرورت ہے۔

# name_already_exists
source: This name already exists.
ur: یہ نام پہلے ہی موجود ہے۔

source: Phone number already exists.
ur: فون نمبر پہلے ہی موجود ہے۔

source: Email or username not found.
ur: ای میل یا صارف نام نہیں ملا۔

# password_is_incorrect
source: Incorrect password.
ur: پاس ورڈ غلط ہے۔

source: ID number already exists.
ur: شناختی نمبر پہلے ہی موجود ہے۔

# nationality_not_exists
source: Nationality does not exist.
ur: قومیت موجود نہیں ہے۔

# end_date_greater_start_date
source: End date cannot be greater than start date.
ur: اختتامی تاریخ شروع کی تاریخ سے بڑی نہیں ہو سکتی۔

# country_not_exists
source: Country does not exist.
ur: ملک موجود نہیں ہے۔

source: Manager does not exist.
ur: مینجر موجود نہیں ہے۔

source: Role does not exist.
ur: کردار موجود نہیں ہے۔

source: User cannot manage themselves.
ur: صارف خود کو منظم نہیں کر سکتا۔

# area_not_exists
source: Area does not exist.
ur: علاقہ موجود نہیں ہے۔

# city_not_exists
source: City does not exist.
ur: شہر موجود نہیں ہے۔

# organization_not_exists
source: Organization does not exist.
ur: تنظیم موجود نہیں ہے۔

# building_not_exists
source: Building does not exist.
ur: عمارت موجود نہیں ہے۔

# floor_not_exists
source: Floor does not exist.
ur: منزل موجود نہیں ہے۔

# section_not_exists
source: Section does not exist.
ur: سیکشن موجود نہیں ہے۔

# point_not_exists
source: Point does not exist.
ur: نقطہ موجود نہیں ہے۔

source: Users not found.
ur: صارفین نہیں ملے۔

source: Shifts not found.
ur: شفٹیں نہیں ملیں۔

source: Organizations not found.
ur: تنظیمیں نہیں ملیں۔

source: Buildings not found.
ur: عمارتیں نہیں ملیں۔

source: Floors not found.
ur: منزلیں نہیں ملیں۔

source: Sections not found.
ur: سیکشنز نہیں ملے۔

# not_assigned_to_task
source: You are not assigned to this task.
ur: آپ کو اس کام کے لیے مقرر نہیں کیا گیا۔

# category_not_exists
source: Category does not exist.
ur: زمرہ موجود نہیں ہے۔

# provider_not_exists
source: Provider does not exist.
ur: فراہم کنندہ موجود نہیں ہے۔

# material_not_exists
source: Material does not exist.
ur: مواد موجود نہیں ہے۔

source: Currently reading required countable point.
ur: فی الحال پڑھنے کے لیے شمار کرنے والا نقطہ درکار ہے۔

source: After reading required countable point.
ur: پڑھنے کے بعد شمار کرنے والا نقطہ درکار ہے۔

# category_cannot_be_own_parent
source: Category cannot be its own parent.
ur: زمرہ اپنا والدین نہیں ہو سکتا۔

# task_cannot_be_own_parent
source: Task cannot be its own parent.
ur: کام اپنا والدین نہیں ہو سکتا۔

source: Invalid OTP.
ur: غلط او ٹی پی۔

# otp_expired
source: OTP has expired.
ur: او ٹی پی کی میعاد ختم ہو گئی۔

# failed
source: Operation failed.
ur: عمل ناکام ہوگیا۔

# device_not_exists
source: Device does not exist.
ur: ڈیوائس موجود نہیں ہے۔

# device_already_assigned_point
source: Device is already assigned to a point.
ur: ڈیوائس پہلے ہی کسی نقطے پر مقرر ہے۔

# parent_task_not_exists
source: Parent task does not exist.
ur: بنیادی کام موجود نہیں ہے۔

# task_not_exists
source: Task does not exist.
ur: کام موجود نہیں ہے۔

# reading_out_allowed_limit_range
source: Reading is out of the allowed limit range.
ur: پڑھائی اجازت شدہ حد سے باہر ہے۔

# task_is_completed
source: Task is already completed.
ur: کام پہلے ہی مکمل ہو چکا ہے۔

# shift_not_exists
source: Shift does not exist.
ur: شفٹ موجود نہیں ہے۔

# cannot_delete_shift_assigned_user_work_location
source: Cannot delete shift assigned to user work location.
ur: اس شفٹ کو حذف نہیں کیا جا سکتا جو صارف کے ورک لوکیشن کو تفویض ہے۔

# user_not_exists
source: User does not exist.
ur: صارف موجود نہیں ہے۔

# tag_not_exists
source: Tag does not exist.
ur: ٹیگ موجود نہیں ہے۔

# leave_not_exists
source: Leave does not exist.
ur: چھٹی موجود نہیں ہے۔

# leave_overlaps
source: Leave overlaps with existing leave.
ur: چھٹی موجودہ چھٹی سے اوورلیپ کر رہی ہے۔

# shift_overlaps
source: Shift overlaps with existing shift.
ur: شفٹ موجودہ شفٹ سے اوورلیپ کر رہی ہے۔

# quantity_greater_available
source: Quantity is greater than available.
ur: مقدار دستیاب سے زیادہ ہے۔

# already_assign_limit
source: Already assigned up to the limit.
ur: پہلے ہی حد تک تفویض کیا گیا ہے۔

# min_or_max_not_exists
source: Minimum or maximum value does not exist.
ur: کم سے کم یا زیادہ سے زیادہ قیمت موجود نہیں ہے۔

# key_not_exists
source: Key does not exist.
ur: کلید موجود نہیں ہے۔

# limit_not_exists
source: Limit does not exist.
ur: حد موجود نہیں ہے۔

# leave_start_future
source: Leave start date is in the future.
ur: چھٹی کی شروعات کی تاریخ مستقبل میں ہے۔

# question_not_exists
source: Question does not exist.
ur: سوال موجود نہیں ہے۔

# choice_not_exists
source: Choice does not exist.
ur: انتخاب موجود نہیں ہے۔

# feedback_device_already_assigned_section
source: Feedback device is already assigned to a section.
ur: فیڈبیک ڈیوائس پہلے ہی کسی سیکشن کو تفویض ہے۔

# feedback_device_not_exists
source: Feedback device does not exist.
ur: فیڈبیک ڈیوائس موجود نہیں ہے۔

# section_usage_not_exists
source: Section usage does not exist.
ur: سیکشن کا استعمال موجود نہیں ہے۔

# already_assigned_an_another
source: Section Is Already Assigned an another
ur: سیکشن پہلے ہی کسی اور کو تفویض کیا جا چکا ہے

# no_internet
source: No Internet Connection
ur: انٹرنیٹ کنکشن دستیاب نہیں

# request_cancelled
source: Request to server was canceled
ur: سرور کو بھیجا گیا درخواست منسوخ کر دیا گیا

# connection_timeout
source: Connection timeout with server
ur: سرور کے ساتھ کنکشن کا وقت ختم ہو گیا

source: Unexpected error: {}
ur: غیر متوقع خرابی: {}

# receive_timeout
source: Receive timeout from server
ur: سرور سے وصول کرنے کا وقت ختم ہو گیا

# send_timeout
source: Send timeout to server
ur: سرور کو بھیجنے کا وقت ختم ہو گیا

# bad_certificate
source: Invalid certificate received
ur: غلط سرٹیفکیٹ موصول ہوا

# redirection
source: Redirection occurred. Please login again.
ur: ری ڈائریکشن ہوا۔ براہ کرم دوبارہ لاگ ان کریں۔

# bad_request
source: Bad request. Please check the data sent.
ur: غلط درخواست۔ براہ کرم بھیجے گئے ڈیٹا کو چیک کریں۔

# unauthorized
source: Unauthorized. Please log in again.
ur: غیر مجاز۔ براہ کرم دوبارہ لاگ ان کریں۔

# forbidden
source: Forbidden. You do not have permission.
ur: ممنوع۔ آپ کے پاس اجازت نہیں ہے۔

# not_found
source: Resource not found.
ur: وسیلہ نہیں ملا۔

# server_error
source: Server error. Please try again later.
ur: سرور کی خرابی۔ براہ کرم بعد میں دوبارہ کوشش کریں۔

# bad_gateway
source: Bad Gateway. Please try again later.
ur: غلط گیٹ وے۔ براہ کرم بعد میں دوبارہ کوشش کریں۔

# service_unavailable
source: Service Unavailable. Please try again later.
ur: سروس دستیاب نہیں۔ براہ کرم بعد میں دوبارہ کوشش کریں۔

# gateway_timeout
source: Gateway Timeout. Please try again later.
ur: گیٹ وے کا وقت ختم ہو گیا۔ براہ کرم بعد میں دوبارہ کوشش کریں۔

# status_code_error
source: Unexpected error with status code {}
ur: اسٹیٹس کوڈ {} کے ساتھ غیر متوقع خرابی

source: Feedback
ur: فیڈ بیک

# feedbackAndAudit
source: Feedback & Audit
ur: فیڈ بیک اور آڈٹ

source: Devices
ur: آلات

source: Auditor
ur: آڈیٹر

source: No auditors available
ur: کوئی آڈیٹر دستیاب نہیں

source: Auditors
ur: آڈیٹرز

source: Select auditors
ur: آڈیٹرز منتخب کریں

source: Please add 4 choices
ur: براہ کرم 4 اختیارات شامل کریں

source: Please select type of rating
ur: براہ کرم درجہ بندی کی قسم منتخب کریں

source: Select type of rating
ur: درجہ بندی کی قسم منتخب کریں

source: ⚈ Stars
ur: ⚈ ستارے

source: ⚈ Emotions
ur: ⚈ جذبات

source: Choices
ur: اختیارات

source: write
ur: لکھیں

# answer_too_long
source: answer is too long
ur: جواب بہت لمبا ہے

# answer_too_short
source: answer is too short
ur: جواب بہت چھوٹا ہے

source: Add More Option
ur: مزید آپشن شامل کریں

source: Edit Question
ur: سوال میں ترمیم کریں

source: Good
ur: اچھا

source: Normal
ur: معمولی

source: Bad
ur: خراب

source: No options available
ur: کوئی اختیارات دستیاب نہیں

source: Select all
ur: سب منتخب کریں

source: Audit
ur: آڈٹ

source: Audits
ur: آڈٹس

# question_label
source: Question:
ur: سوال:

source: Section:
ur: سیکشن:

source: Questions
ur: سوالات

source: Location
ur: مقام

source: Feedback Name
ur: فیڈ بیک کا نام

source: Search
ur: تلاش کریں

source: Select type
ur: قسم منتخب کریں

# no_questions
source: There are no questions
ur: کوئی سوالات نہیں ہیں

source: Assign More Questions
ur: مزید سوالات تفویض کریں

source: Select device
ur: ڈیوائس منتخب کریں

source: Create
ur: بنائیں

source: Assign Questions
ur: سوالات تفویض کریں

source: Create Device
ur: ڈیوائس بنائیں

source: Device Answers
ur: ڈیوائس کے جوابات

source: Answer
ur: جواب

source: Question number
ur: سوال نمبر

source: Find device
ur: ڈیوائس تلاش کریں

source: Edit Device
ur: ڈیوائس میں ترمیم کریں

source: Answer Details
ur: جواب کی تفصیلات

# true_value
source: True
ur: درست

# false_value
source: False
ur: غلط

source: Find location
ur: مقام تلاش کریں

source: Audit History
ur: آڈٹ کی ہسٹری

source: Start
ur: شروع کریں

source: Auditor Questions
ur: آڈیٹر کے سوالات

source: Send
ur: بھیجیں

source: Enter your answer...
ur: اپنا جواب درج کریں...

source: Name too short
ur: نام بہت چھوٹا ہے

source: Name too long
ur: نام بہت لمبا ہے

# nameRequired
source: Name is required
ur: نام ضروری ہے

source: Out of
ur: میں سے

source: Details
ur: تفصیلات

source: Add Question
ur: سوال شامل کریں

source: find question
ur: سوال تلاش کریں

source: The Question
ur: سوال

source: write question here
ur: یہاں سوال لکھیں

# question_required
source: Question is Required
ur: سوال ضروری ہے

source: Question too long
ur: سوال بہت لمبا ہے

source: Question too short
ur: سوال بہت چھوٹا ہے

# question
source: Questions
ur: سوالات

# create_question
source: Create questions
ur: سوالات بنائیں

source: Multiple options
ur: متعدد اختیارات

source: Checkbox
ur: چیک باکس

source: Text input
ur: ٹیکسٹ ان پٹ

source: Rating
ur: ریٹنگ

source: True or false
ur: سچ یا جھوٹ

# no_work_location_assigned
source: No work location assigned to this user
ur: اس صارف کے لیے کوئی کام کی جگہ مقرر نہیں کی گئی

source: Auditor Work Location
ur: آڈیٹر کا کام کا مقام

source: Select question type
ur: سوال کی قسم منتخب کریں

source: Question Type
ur: سوال کی قسم

source: Select feedback
ur: فیڈبیک منتخب کریں

# reStartButton
source: Restart
ur: دوبارہ شروع کریں
